---
kind: method
id: M:Autodesk.Revit.DB.NavisworksExportOptions.Dispose
source: html/6f8c3241-e216-a3df-54da-f80679a66803.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.Dispose Method

Releases all resources used by the NavisworksExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```